InformationRegisters/КСУ_Напоминания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_Напоминания</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЗадачиПлана</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КСУ_ИерархияПостов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_ИерархияПостов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_АдресацияЗадачПланаДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_АдресацияЗадачПланаДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ИА_РегламентныеЗадачиКоммцентра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_РегламентныеЗадачиКоммцентра</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалить_Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалить_Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалить_Ситуация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалить_Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНапоминанияПослание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Адресация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пост</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СПодчиненными</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИА_ЗадачиКоммцентраСервер/Ext/Module.bsl
Процедура КСУ_ЗадачаКоммцентра(Настройка) Экспорт
	
	
	РеглЗадача = Справочники.ИА_РегламентныеЗадачиКоммцентра.НайтиПоКоду(Настройка);
	
	адресаты = ПолучитьАдресатов(РеглЗадача);
	
	Для каждого адр из адресаты Цикл 
		Если РеглЗадача.ВидНапоминанияПослание Тогда
			Послание = Задачи.ИА_ЗадачаПланаДействий.СоздатьЗадачу();
			ЗаполнитьЗначенияСвойств(Послание, РеглЗадача);
			Послание.Отправлена = Истина;
			Послание.Дата = ТекущаяДата();
			Послание.РегламентнаяЗадача = РеглЗадача;
			Послание.ЭтоПослание = Истина;
			Послание.Пользователь = адр;
			Послание.Записать();
		Иначе
			мен = РегистрыСведений.КСУ_Напоминания.СоздатьМенеджерЗаписи();
			мен.Тема = РеглЗадача.Наименование;
			мен.Пользователь = адр;
			мен.Объект = мен.Тема;
			мен.Период = ТекущаяДата();
			мен.Текст = РеглЗадача.Содержание;			
			мен.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьАдресатов(регЗадача)
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИА_АдресацияЗадачПланаДействий.Пользователь КАК Пользователь
	               |ИЗ
	               |	РегистрСведений.КСУ_ИерархияПостов КАК КСУ_ИерархияПостов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИА_РегламентныеЗадачиКоммцентра.Адресация КАК ИА_РегламентныеЗадачиКоммцентраАдресация
	               |		ПО (ИА_РегламентныеЗадачиКоммцентраАдресация.Ссылка = &регЗадача)
	               |			И КСУ_ИерархияПостов.Родитель = ИА_РегламентныеЗадачиКоммцентраАдресация.Пост
	               |			И (КСУ_ИерархияПостов.Пост = ИА_РегламентныеЗадачиКоммцентраАдресация.Пост
	               |				ИЛИ ИА_РегламентныеЗадачиКоммцентраАдресация.СПодчиненными)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	               |		ПО КСУ_ИерархияПостов.Пост = ИА_АдресацияЗадачПланаДействий.Пост";
	Запрос.УстановитьПараметр("регЗадача", регЗадача);
	рез = запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
	Возврат рез;
КонецФункции
